NordicSemiconductor/nrfx/bsp/stable/mdk/iar_startup_nrf54lc10a_flpr.s
        PUBWEAK SuperVisorSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorSoftware_Handler
        j .

        PUBWEAK MachineSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineSoftware_Handler
        j .

        PUBWEAK UserTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserTimer_Handler
        j .

        PUBWEAK SuperVisorTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorTimer_Handler
        j .

        PUBWEAK MachineTimer_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineTimer_Handler
        j .

        PUBWEAK UserExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UserExternal_Handler
        j .

        PUBWEAK SuperVisorExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SuperVisorExternal_Handler
        j .

        PUBWEAK MachineExternal_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MachineExternal_Handler
        j .

        PUBWEAK CLICSoftware_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
CLICSoftware_Handler
        j .


       ; Dummy interrupt handlers

        PUBWEAK  VPRCLIC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_0_IRQHandler
        j .

        PUBWEAK  VPRCLIC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_1_IRQHandler
        j .

        PUBWEAK  VPRCLIC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_2_IRQHandler
        j .

        PUBWEAK  VPRCLIC_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_3_IRQHandler
        j .

        PUBWEAK  VPRCLIC_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_4_IRQHandler
        j .

        PUBWEAK  VPRCLIC_5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_5_IRQHandler
        j .

        PUBWEAK  VPRCLIC_6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_6_IRQHandler
        j .

        PUBWEAK  VPRCLIC_7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_7_IRQHandler
        j .

        PUBWEAK  VPRCLIC_8_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_8_IRQHandler
        j .

        PUBWEAK  VPRCLIC_9_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_9_IRQHandler
        j .

        PUBWEAK  VPRCLIC_10_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_10_IRQHandler
        j .

        PUBWEAK  VPRCLIC_11_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_11_IRQHandler
        j .

        PUBWEAK  VPRCLIC_12_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_12_IRQHandler
        j .

        PUBWEAK  VPRCLIC_13_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_13_IRQHandler
        j .

        PUBWEAK  VPRCLIC_14_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_14_IRQHandler
        j .

        PUBWEAK  VPRCLIC_15_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_15_IRQHandler
        j .

        PUBWEAK  VPRCLIC_16_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_16_IRQHandler
        j .

        PUBWEAK  VPRCLIC_17_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_17_IRQHandler
        j .

        PUBWEAK  VPRCLIC_18_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_18_IRQHandler
        j .

        PUBWEAK  VPRCLIC_19_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_19_IRQHandler
        j .

        PUBWEAK  VPRCLIC_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_20_IRQHandler
        j .

        PUBWEAK  VPRCLIC_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_21_IRQHandler
        j .

        PUBWEAK  VPRCLIC_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_22_IRQHandler
        j .

        PUBWEAK  VPRCLIC_23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_23_IRQHandler
        j .

        PUBWEAK  VPRCLIC_24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_24_IRQHandler
        j .

        PUBWEAK  VPRCLIC_25_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_25_IRQHandler
        j .

        PUBWEAK  VPRCLIC_26_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_26_IRQHandler
        j .

        PUBWEAK  VPRCLIC_27_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_27_IRQHandler
        j .

        PUBWEAK  VPRCLIC_28_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_28_IRQHandler
        j .

        PUBWEAK  VPRCLIC_29_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_29_IRQHandler
        j .

        PUBWEAK  VPRCLIC_30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_30_IRQHandler
        j .

        PUBWEAK  VPRCLIC_31_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_31_IRQHandler
        j .

        PUBWEAK  SPU00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU00_IRQHandler
        j .

        PUBWEAK  MPC00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC00_IRQHandler
        j .

        PUBWEAK  AAR00_CCM00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR00_CCM00_IRQHandler
        j .

        PUBWEAK  ECB00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ECB00_IRQHandler
        j .

        PUBWEAK  VPR00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR00_IRQHandler
        j .

        PUBWEAK  RRAMC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RRAMC_IRQHandler
        j .

        PUBWEAK  CTRLAP_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CTRLAP_IRQHandler
        j .

        PUBWEAK  CM33SS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CM33SS_IRQHandler
        j .

        PUBWEAK  TIMER00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER00_IRQHandler
        j .

        PUBWEAK  EGU00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU00_IRQHandler
        j .

